INSERT INTO fleet_traffic_fines.fines (
    fine_uin,
    license_plate,
    registration_certificate,
    inn,
    kpp,
    updated_at,
    status,
    number_of_photos,
    payment_details,
    issued_by,
    issued_at,
    offense_at,
    discount_until,
    collection_at,
    amount,
    paid_amount,
    fiscal_status,
    offense_address,
    article,
    loaded_at,
    update_loaded_at,
    payment,
    discount_amount
) VALUES (
    'FINE_UIN_01',
    'CARNUMBER01',
    'CARSTS01',
    NULL,
    NULL,
    '2022-01-01T12:00:00+03:00',
    'issued',
    0,
    '{
        "BIK": "010407105",
        "INN": "2466050868",
        "KBK": "18811601121010001140",
        "KPP": "246601001",
        "Bank": 
            "ОТДЕЛЕНИЕ КРАСНОЯРСК БАНКА РОССИИ//УФК по Красноярскому краю г. Красноярск",
        "Name": 
            "ЦАФАП ГИБДД МВД по Республике Татарстан",
        "OKTMO": "04701000",
        "CorrAccount": "40102810245370000011",
        "PaymentName": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)",
        "AccountNumber": "03100643000000011900"
    }',
    'ЦАФАП ГИБДД МВД по Республике Татарстан',
    '2022-01-01T00:00:00+00:00',
    NULL,
    '2022-02-01T00:00:00+00:00',
    '2022-03-11T00:00:00+00:00',
    '500.0000',
    '0.0000',
    'Возбуждено ИП',
    'А Д ОБХОД Г. КРАСНОЯРСКА',
    'ПРЕВЫШЕНИЕ УСТАНОВЛЕННОЙ СКОРОСТИ ДВИЖЕНИЯ ТРАНСПОРТНОГО '
    'СРЕДСТВА НА ВЕЛИЧИНУ БОЛЕЕ 20, НО НЕ БОЛЕЕ 40 КМ/Ч',
    '2022-01-01T12:00:00+03:00',
    '2022-01-01T12:00:00+03:00',
    '500.0000',
    '0.0000'
), (
    'FINE_UIN_02',
    'CARNUMBER02',
    'CARSTS02',
    NULL,
    NULL,
    '2022-01-01T12:00:00+03:00',
    'issued',
    0,
    '{
        "BIK": "010407105",
        "INN": "2466050868",
        "KBK": "18811601121010001140",
        "KPP": "246601001",
        "Bank": 
            "ОТДЕЛЕНИЕ КРАСНОЯРСК БАНКА РОССИИ//УФК по Красноярскому краю г. Красноярск",
        "Name": 
            "ЦАФАП ГИБДД МВД по Республике Татарстан",
        "OKTMO": "04701000",
        "CorrAccount": "40102810245370000011",
        "PaymentName": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)",
        "AccountNumber": "03100643000000011900"
    }',
    'ЦАФАП ГИБДД МВД по Республике Татарстан',
    '2021-12-31T00:00:00+00:00',
    NULL,
    '2022-01-01T00:00:00+00:00',
    '2022-03-12T00:00:00+00:00',
    '500.0000',
    '0.0000',
    'Возбуждено ИП',
    'А Д ОБХОД Г. КРАСНОЯРСКА',
    'ПРЕВЫШЕНИЕ УСТАНОВЛЕННОЙ СКОРОСТИ ДВИЖЕНИЯ ТРАНСПОРТНОГО '
    'СРЕДСТВА НА ВЕЛИЧИНУ БОЛЕЕ 20, НО НЕ БОЛЕЕ 40 КМ/Ч',
    '2022-01-01T12:00:00+03:00',
    '2022-01-01T12:00:00+03:00',
    '250.0000',
    '250.0000'
), (
    'FINE_UIN_03',
    NULL,
    NULL,
    '1234567890_PD',
    NULL,
    '2022-01-01T12:00:00+03:00',
    'paid',
    0,
    '{
        "BIK": "010407105",
        "INN": "2466050868",
        "KBK": "18811601121010001140",
        "KPP": "246601001",
        "Bank": 
            "ОТДЕЛЕНИЕ КРАСНОЯРСК БАНКА РОССИИ//УФК по Красноярскому краю г. Красноярск",
        "Name": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)(ЦАФАП ОДД ГИБДД ГУ МВД России по Красноярскому краю)",
        "OKTMO": "04701000",
        "CorrAccount": "40102810245370000011",
        "PaymentName": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)",
        "AccountNumber": "03100643000000011900"
    }',
    'УФК по Красноярскому краю '
    '(ГУ МВД России по Красноярскому краю)'
    '(ЦАФАП ОДД ГИБДД ГУ МВД России по Красноярскому краю)',
    '2021-12-31T00:00:00+00:00',
    NULL,
    '2022-01-01T00:00:00+00:00',
    '2022-03-10T00:00:00+00:00',
    '5500.0000',
    '0.0000',
    'Возбуждено ИП',
    'А Д ОБХОД Г. КРАСНОЯРСКА',
    'ПРЕВЫШЕНИЕ УСТАНОВЛЕННОЙ СКОРОСТИ ДВИЖЕНИЯ ТРАНСПОРТНОГО '
    'СРЕДСТВА НА ВЕЛИЧИНУ БОЛЕЕ 60 КМ/Ч',
    '2022-01-01T12:00:00+03:00',
    '2022-01-01T12:00:00+03:00',
    '2750.0000',
    '2750.0000'
);
