INSERT INTO
  pay.balances (
    balance_id,
    date,
    clid,
    bcid,
    contract_id,
    contract_type,
    contract_alias,
    contract_limit,
    amount,
    currency,
    request_flag,
    org_id,
    reject_code,
    reject_reason
  )
VALUES
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '7151963',
    '253207', 'PROMOCODES', 'ОФ-34629/15', '10000.0', '45332.88', 'RUB',
    'Y', 'ORG', 'N_CONTRACT_ORIGINAL_NOT_PRESENT', 'Отсутствует оригинал договора.'
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '32511442',
    '278761', 'TAXI', 'ОФ-63864/17', '0.0', '4232.21', 'RUB',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '32297945',
    '279770', 'PROMOCODES', 'ОФ-63287/17', '25000.0', '24421.24', 'RUB',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '34859260',
    '295059', 'PROMOCODES', 'ОФ-70254/17', '0.0', '0.0', 'RUB',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '38750744',
    '323534', 'CORPORATE', 'РАС-30788', '750.0', '6522.0', 'RUB',
    'Y', 'ORG', 'N_DOCUMENT_ORIGINAL_NOT_PRESENT', 'Отсутствуют оригиналы документов за предыдущие периоды.'
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '55966500',
    '656839', 'TAXI', 'ОФ-198875/19', '100.0', '423.21', 'EUR',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '32511442',
    '679178', 'CORPORATE', 'РАС-206300', '100.0', '703.0', 'EUR',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '58074384',
    '732636', 'PROMOCODES', 'ОФ-228369/19', '1500.0', '1017.02', 'EUR',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID00', '30429664',
    '844463', 'CORPORATE', 'РАС-285640', '750.0', '19660.8', 'RUB',
    'Y', 'ORG', NULL, NULL
  ),
  (
    '75054400', '2020-03-21T13:30:00+03:00', 'CLID01', '34501203',
    '293599', 'PROMOCODES', 'ОФ-69450/17', '0.0', '75927.48', 'RUB',
    'Y', 'ORG', NULL, NULL
  );
