INSERT INTO modx_web_user_attributes (
    id,
    date_reg,
    internalKey,
    fullname,
    name_small,
    photo,
    phone,
    blocked,
    interface,
    trans_guest_block,
    trans_guest,
    pay_page_option,
    pay_page_bw,
    proc1,
    proc2,
    proc3,
    proc4,
    proc_all,
    price1,
    price2,
    price3,
    price4,
    price_all,
    show_name,
    saving_up_for
) VALUES
(1,0, 1, 'нормальный', '', 'photo1', '', 0, 'restaurant', 0, 0, 1, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, 'почку'),
(2,0, 2, 'заблоченный', '', '', '', 1, 'restaurant', 1, 0, 2, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(3,0, 3, 'кафе', 'админ кафе', 'photo2', '', 0, 'restaurant', 1, 2, 2, 1, 5, 7, 10, 15, 10, 25, 100, 300, 500, 1000, 1, ''),
(4,0, 4, '', 'юзер кафе без имени', '', '', 0, 'restaurant', 1, 0, 0, 0, 0, 0, 0, 0, 0, 50, 100, 300, 500, 0, 0, ''),
(5, 1633612189, 5, 'заблоченный юзер кафе', '', '', '', 1, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(6,0, 6, '', '', '', 'юзер кафе без имени с телефоном', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(7,0, 7, 'отель', 'админ отеля', '', '', 0, 'hotel', 1, 1, 1, 0, 10, 14, 20, 30, 0, 50, 100, 300, 500, 0, 0, ''),
(8,0, 8, 'горничная в отеле', '', '', '', 0, 'hotel', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(9,0, 9, 'номер в отеле', '', '', '', 0, 'hotel', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(10,0, 10, 'ещё кафе', 'админ второго кафе', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(11,0, 11, 'официант', 'официант второго кафе', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(12,0, 12, 'суперадмин кафе', '', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(13,0, 13, 'кафе без суперадмина', 'админ кафе', '', '', 0, 'restaurant', 1, 0, 1, 1, 5, 7, 10, 15, 5, 50, 100, 300, 500, 0, 1, ''),
(14,0, 14, 'ещё официант', 'официант кафе без суперадмина', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(15,0, 15, 'суперадмин ресторана', '', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(16,0, 16, 'ресторан', 'админ ресторана', '', '', 0, 'restaurant', 1, 0, 1, 1, 5, 7, 10, 15, 5, 50, 100, 300, 500, 0, 1, ''),
(17,0, 17, 'официант', 'официант ресторана', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(18,0, 18, 'официант', 'официант ресторана и второго кафе', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(19,0, 19, 'официант', 'скрытый официант кафе', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(20,0, 100001, 'официант', 'с длинным кодом', '', '', 0, 'restaurant', 1, 0, 0, 0, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 0, ''),
(21,0, 21, 'еще кафе', 'админ кафе', 'photo2', '', 0, 'restaurant', 1, 2, 1, 1, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 1, ''),
(22,0, 22, 'кафе шоко', 'админ кафе', 'photo2', '', 0, 'restaurant', 1, 2, 1, 1, 5, 7, 10, 15, 0, 50, 100, 300, 500, 0, 1, '')
;

INSERT INTO modx_web_groups (
    webuser,
    webgroup
) VALUES
(1, 1),
(2, 1),
(3, 2),
(4, 1),
(5, 1),
(6, 1),
(7, 2),
(8, 6),
(9, 5),
(10, 2),
(11, 1),
(12, 10),
(13, 2),
(14, 1),
(15, 10),
(16, 2),
(17, 1),
(18, 1),
(19, 1),
(100001, 1)
;

INSERT INTO modx_web_users_org (
    id,
    user_id,
    to_user_id,
    status,
    show_in_menu
) VALUES
(1, 3, 3, 1, 1),
(2, 3, 4, 1, 1),
(3, 3, 5, 1, 1),
(4, 3, 6, 1, 1),
(5, 9, 8, 1, 1),
(6, 10, 11, 1, 1),
(7, 13, 14, 1, 1),
(8, 16, 17, 1, 1),
(9, 16, 18, 1, 1),
(10, 10, 18, 1, 1),
(11, 3, 19, 1, 0),
(11, 3, 100001, 1, 0)
;

INSERT INTO modx_s_admin_to_admin_point (
    id,
    user_id,
    to_user_id,
    who,
    date_time
) VALUES
(1, 3, 12, 0, 1579455225),
(2, 10, 12, 0, 1579455225),
(2, 16, 15, 0, 1579455225)
;

INSERT INTO modx_web_users_pays (
  id,
  to_user_id,
  amount,
  transaction_id,
  transaction_status,
  transaction_pay_date,
  is_b2p_fail,
  is_apple,
  is_google,
  is_samsung,
  is_yandex,
  date_created,
  procent,
  type,
  language,
  test,
  is_blago,
  who,
  is_ecommpay,
  is_best2pay,
  best2pay_fee,
  code,
  room_id,
  comment,
  parent_id,
  idempotenceKey,
  message,
  email,
  pan
)
VALUES
(35, 6, 4000,25,'succeeded',1633612189,0,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',22,'','','',''),
(36, 5, 4000,24,'succeeded',1633612189,0,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',22,'','','','1234567890123456'),
(37, 5, 3,27,'succeeded',1633612189,0,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',22,'','','','1234567890123456'),
(38, 5, 3,28,'succeeded',1633612189,0,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',22,'','','','1234567890123456'),
(39, 5, 3,29,'succeeded',1633612189,0,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',22,'','','','1234567890123456'),
(40, 1, 3,30,'pending',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',22,'','','',''),
(41, 1, 3,31,'pending',0,1,0,1,0,0,100,2,0, '',0,0,0,0,1,0,0,0,'',40,'','','',''),
(26, 2, 3,1,'pending',0,1,0,1,0,0,100,2,0, '',0,0,0,0,1,0,0,0,'',22,'','','',''),
(25, 3719, -3,2,'pending',0,1,0,1,0,0,100,2,0, '',0,0,0,0,1,0,0,0,'',22,'','','',''),
(24, 3719, -1,3,'pending',0,1,0,1,0,0,100,3,0, '',0,0,0,0,1,0,0,0,'',22,'','','',''),
(23, 3719, 10,4,'pending',0,1,0,1,0,0,100,4,0, '',0,0,0,0,1,0,0,0,'',22,'','','',''),
(22, 2, 100,5,'pending',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',0,'','','',''),
(42, 2, 100,6,'pending',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',0,'','','',''),
(43, 2, 100,7,'succeeded',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',0,'','','',''),
(44, 3719, 3,8,'succeeded',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',43,'','','',''),
(45, 2, 100,9,'succeeded',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',0,'','','',''),
(46, 2, 100,10,'pending',0,1,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',0,'','','',''),
(47, 6, 3000,26,'succeeded',1633612489,0,0,1,0,0,100,0,0, '',0,0,0,0,1,0,0,0,'',0,'','','','')
;

INSERT INTO modx_web_users_reviews (
    id,
    user_id,
    user_sub_id,
    star,
    review,
    photo,
    is_send_phone,
    service,
    quality,
    clean,
    atmosphere,
    speed,
    good_atmosphere,
    delicious_food,
    delightful_service,
    good_speed,
    master_gold_hand,
    pay_page_type,
    date_time,
    order_id
) VALUES
(1, 1, 0, 1, 'вы все дураки одна я умная в белом пальто стою красивая', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1631807582, NULL),
(2, 4, 0, 5, 'отзыв о пользователе 4 со всеми быстрыми ответами', '', 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1631807583, NULL),
(3, 4, 0, 3, 'отзыв о пользователе 4 со частью быстрых ответов', '', 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1631807584, NULL),
(4, 2, 0, 4, '', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1631807585, NULL),
(5, 2, 0, 5, '', 'ссылка_на_фото', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1631807586, NULL),
(6, 1, 0, 1, 'не оч', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1631807582, 100500),
(7, 6, 0, 5, 'отзыв о пользователе 6 с платежом', '', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1631807884, 47)
;

INSERT INTO modx_users_whitelist (
  user_id,
  active,
  vip
)
VALUES
(3, 0, 1),
(4, 0, 0)
;
