INSERT INTO fleet_traffic_fines.fines (
    fine_uin,
    license_plate,
    registration_certificate,
    updated_at,
    status,
    number_of_photos,
    payment_details,
    issued_by,
    issued_at,
    offense_at,
    discount_until,
    collection_at,
    amount,
    paid_amount,
    fiscal_status,
    offense_address,
    article,
    loaded_at,
    payment
) VALUES (
    'FINE_UIN_01',
    'CAR_NUMBER_01',
    'CAR_STS_01',
    '2022-01-01T12:00:00+03:00',
    'paid',
    0,
    '{
        "BIK": "010407105",
        "INN": "2466050868",
        "KBK": "18811601121010001140",
        "KPP": "246601001",
        "Bank": 
            "ОТДЕЛЕНИЕ КРАСНОЯРСК БАНКА РОССИИ//УФК по Красноярскому краю г. Красноярск",
        "Name": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)(ЦАФАП ОДД ГИБДД ГУ МВД России по Красноярскому краю)",
        "OKTMO": "04701000",
        "CorrAccount": "40102810245370000011",
        "PaymentName": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)",
        "AccountNumber": "03100643000000011900"
    }',
    'УФК по Красноярскому краю '
    '(ГУ МВД России по Красноярскому краю)'
    '(ЦАФАП ОДД ГИБДД ГУ МВД России по Красноярскому краю)',
    '2022-01-01T00:00:00+00:00',
    NULL,
    '2022-01-01T00:00:00+00:00',
    '2022-01-01T00:00:00+00:00',
    '500.0000',
    '0.0000',
    'Возбуждено ИП',
    'А Д ОБХОД Г. КРАСНОЯРСКА',
    'ПРЕВЫШЕНИЕ УСТАНОВЛЕННОЙ СКОРОСТИ ДВИЖЕНИЯ ТРАНСПОРТНОГО '
    'СРЕДСТВА НА ВЕЛИЧИНУ БОЛЕЕ 20, НО НЕ БОЛЕЕ 40 КМ/Ч',
    '2022-01-01T12:00:00+03:00',
    '500.0000'
), (
    'FINE_UIN_02',
    'CAR_NUMBER_02',
    'CAR_STS_02',
    '2022-01-01T12:00:00+03:00',
    'issued',
    0,
    '{
        "BIK": "010407105",
        "INN": "2466050868",
        "KBK": "18811601121010001140",
        "KPP": "246601001",
        "Bank": 
            "ОТДЕЛЕНИЕ КРАСНОЯРСК БАНКА РОССИИ//УФК по Красноярскому краю г. Красноярск",
        "Name": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)(ЦАФАП ОДД ГИБДД ГУ МВД России по Красноярскому краю)",
        "OKTMO": "04701000",
        "CorrAccount": "40102810245370000011",
        "PaymentName": 
            "УФК по Красноярскому краю (ГУ МВД России по Красноярскому краю)",
        "AccountNumber": "03100643000000011900"
    }',
    'УФК по Красноярскому краю '
    '(ГУ МВД России по Красноярскому краю)'
    '(ЦАФАП ОДД ГИБДД ГУ МВД России по Красноярскому краю)',
    '2021-12-31T00:00:00+00:00',
    NULL,
    '2022-01-01T00:00:00+00:00',
    '2022-01-01T00:00:00+00:00',
    '500.0000',
    '0.0000',
    'Возбуждено ИП',
    'А Д ОБХОД Г. КРАСНОЯРСКА',
    'ПРЕВЫШЕНИЕ УСТАНОВЛЕННОЙ СКОРОСТИ ДВИЖЕНИЯ ТРАНСПОРТНОГО '
    'СРЕДСТВА НА ВЕЛИЧИНУ БОЛЕЕ 20, НО НЕ БОЛЕЕ 40 КМ/Ч',
    '2022-01-01T03:00:00+03:00',
    '500.0000'
);

INSERT INTO fleet_traffic_fines.park_fines (
    fine_uin,
    car_id,
    park_id,
    status,
    issued_at,
    loaded_at
) VALUES (
    'FINE_UIN_01',
    'CAR_ID_01',
    'PARK-ID-01',
    'paid',
    '2022-01-01T00:00:00+00:00',
    '2022-01-01T12:00:00+03:00'
), (
    'FINE_UIN_02',
    'CAR_ID_02',
    'PARK-ID-01',
    'issued',
    '2021-12-31T00:00:00+00:00',
    '2022-01-01T03:00:00+03:00'
);

INSERT INTO fleet_traffic_fines.park_bank_accounts (
    park_id,
    payment_name,
    tin_pd_id,
    KPP,
    bank,
    BIK,
    account_number_pd_id,
    corr_account
) VALUES (
    'PARK-ID-01',
    'NAME_01',
    'TIN_PD_01',
    'KPP_PD_01',
    'BANK_01',
    'BIK_01',
    'ACC_PD_01',
    'CORR_01'
);
