INSERT INTO invites.invites
    (id, exam, entity_type, expires, comment)
VALUES
    ('11111111-1111-1111-1111-111111111111', 'dkk', 'driver', '2220-09-22 00:00:00', 'Комментарий 1'),
    ('22222222-2222-2222-2222-222222222222', 'dkk', 'driver', '2220-09-22 00:00:00', 'Комментарий 2'),
    ('33333333-3333-3333-3333-333333333333', 'dkk', 'driver', '2220-09-22 00:00:00', 'Комментарий 3'),
    ('44444444-4444-4444-4444-444444444444', 'dkk', 'driver', '2220-09-22 00:00:00', 'Комментарий 4');

INSERT INTO invites.filters
    (invite_id, key, value)
VALUES
    ('11111111-1111-1111-1111-111111111111', 'car_number', 'car_number-1'),
    ('22222222-2222-2222-2222-222222222222', 'car_number', 'car_number-2'),
    ('33333333-3333-3333-3333-333333333333', 'car_number', 'car_number-3'),
    ('44444444-4444-4444-4444-444444444444', 'license_pd_id', 'license-1');
