var fakeResTr = {
	'weather': ['wea', 'weather', [
		['weather!!!!!', 1.23178e-05, {'tpah': [0, 3, 7]}],
		['weather forecast', 2.84685e-06, {'tpah': [0, 3, 7]}],
		['weather istanbul', 2.20988e-06, {'tpah': [0, 3, 7]}],
		['weather.com', 6.6996e-07, {'tpah': [0, 3, 11]}]
	],
		['fact', 'weather istanbul', '21 °C'],
		{
			'suggestions': [
				['weather underground', 6.069906249e-07],
				['weather istanbul 15 days', 6.03355943e-07],
				['weather forecast istanbul', 4.070835189e-07],
				['weatheronline istanbul', 1.671950258e-07],
				['weather in istanbul', 1.090402293e-07]
			]
		}
	],
	'navigation': ['fac', 'facebook', [
		['facebook!!!!!', 0.0362829, {'tpah': [0, 3, 8]}],
		['facebook', 0.00756282, {'tpah': [0, 3, 8]}],
		['facebook.com', 0.000136159, {'tpah': [0, 3, 12]}],
		['facer', 7.56012e-06, {'tpah': [0, 3, 5]}]],
		['nav', 'Sosyal paylaşım sitesi', 'Sosyal paylaşım sitesi', 'facebook.com', 'http:\/\/yandex.com.tr\/clck\/jsredir?text=facebook&from=yandex.com.tr%3Bsuggest%3Bweb&state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3Dfac%2Fsuggestion%3Dfacebook%2Fregion%3D983%2F%2A&data=url%3Dhttp%253A%252F%252Ffacebook.com%26ts%3D1478699899%26uid%3D2715009631478610447&sign=507adf3a2089ab57f07f54f063ac3381&ref=https%3A%2F%2Fwww-rc.yandex.com.tr%2F&keyno=0&l10n=tr'],
		{
			'suggestions': [
				['facebook giriş yap', 0.0008239297895],
				['facebook hoşgeldin', 5.633745241e-05],
				['facebook hoşgeldin giriş ol kaydol', 3.35734876e-05],
				['facebook giriş yap hoşgeldin', 1.544009683e-05],
				['facebook hesap silme', 1.076590524e-05]
			]
		}
	],
	'traffic': ['tra', 'translate',
		[
			['translate!!!!!', 0.00137787, {'tpah': [0, 3, 9]}],
			['trafik', 0.000216922, {'tpah': [0, 3, 6]}],
			['transformice', 0.00018672, {'tpah': [0, 3, 12]}],
			['trabzonspor', 0.000104893, {'tpah': [0, 3, 11]}]],
		['fact', 'trafik durumu', '6 ↑'],
		{
			'suggestions': [
				['translate google', 7.754214312e-05],
				['trabzonspor fenerbahçe', 3.544170977e-05],
				['trafik ceza sorgulama', 2.485026926e-05],
				['trakya üniversitesi', 1.748641807e-05],
				['trafik cezası ödeme', 1.310300104e-05]
			]
		}
	],
	'fact': ['длина', 'длина окружности', [
		['длина окружности!!!!', 1.85167e-08, {'tpah': [6, 6, 16]}],
		['длина окружности формула', 7.76389e-09, {'tpah': [6, 6, 16]}],
		['длина экватора', 6.14444e-09, {'tpah': [6, 6, 14]}],
		['длина волны', 5.93056e-09, {'tpah': [6, 6, 11]}]],
		['fact', 'длина окружности', 'l = 2πR (или πD)'],
		{
			'suggestions': [
				['длина австралии с запада на восток', 3.539869065e-09],
				['длина великой китайской стены', 2.252777742e-09]
			]
		}
	],
	'ramadan': ['rama', 'ramazan bayramı 2016', [
		['ramazan', 0.000119432, {'tpah': [0, 4, 7]}], ['ramazan bayramı', 5.09424e-05, {'tpah': [0, 4, 7]}],
		['ramazan yetkin', 1.27538e-05, {'tpah': [0, 4, 7]}],
		['ramazan ne', 1.26959e-05, {'tpah': [0, 4, 7]}]],
		['fact', 'ramazan bayramı 2016', '5-6-7 Temmuz 2016, Salı, Çarşamba, Perşembe'],
		{
			'suggestions': [
				['ramazan bayramı 2016', 3.156351158e-05, {'src': 'B'}],
				['ramazan ne zaman başlıyor 2016', 9.646425497e-06, {'src': 'B'}],
				['ramazan bayrama ne zaman 2016', 7.454716979e-06, {'src': 'B'}],
				['ramazan yetkin tarih videoları 2016', 4.445206741e-06, {'src': 'B'}],
				['ramazan yetkin 2016', 4.427033218e-06, {'src': 'B'}]]
		}]
};

var fakeResRu = {
	'weather_in_spb': ['погода в са', 'погода в санкт-петербурге',
		[['погода в санкт-петербурге', 0.000743113, {'tpah': [9, 11, 25]}],
			['погода в санкт-петербурге на неделю', 0.000113992, {'tpah': [9, 11, 25]}],
			['погода в самаре', 3.85193e-06, {'tpah': [9, 11, 15]}],
			['погода в саратове', 1.15605e-06, {'tpah': [9, 11, 17]}]],
		['fact', 'погода в санкт-петербурге', '−1 °C'],
		{
			'suggestions': [
				['погода в санкт-петербурге на неделю от гисметео', 2.223836054e-05, {'src': 'B'}],
				['погода в санкт-петербурге на месяц апрель 2017', 2.128770211e-05, {'src': 'B'}],
				['погода в санкт-петербурге на неделю от гисметео на 14 дней', 7.943277524e-06, {'src': 'B'}],
				['погода в санкт-петербурге на 14 дней от гидрометцентра', 4.490393167e-06, {'src': 'B'}],
				['погода в санкт-петербурге на неделю от гисметео на неделю', 3.992764505e-06, {'src': 'B'}]
			]
		}],
	'time_of_fall': ['время зака', 'время заката и рассвета в спб',
		[['время заката', 2.62898e-07, {'tpah': [6, 10, 12]}],
			['время заката и рассвета', 1.19713e-07, {'tpah': [6, 10, 12]}],
			['время заката спб', 6.22036e-08, {'tpah': [6, 10, 12]}],
			['время закалки', 7.04191e-09, {'tpah': [6, 10, 13]}]],
		['fact', 'время заката спб', '20:14'],
		{
			'suggestions': [
				['время заката и рассвета в спб', 1.173652109e-07, {'src': 'B'}],
				['время заката солнца сегодня', 1.877843481e-08, {'src': 'B'}],
				['время закат и восход в выборг', 5.868260544e-09, {'src': 'B'}],
				['время заката и восхода солнца', 4.694608702e-09, {'src': 'B'}],
				['время заказа в макдональдсе', 2.347304351e-09, {'src': 'B'}]]
		}],
	'traffic': ['пробк', 'пробки спб',
		[['пробки', 0.000212305, {'tpah': [0, 5, 6]}],
			['пробки спб', 0.000160085, {'tpah': [0, 5, 6]}],
			['пробка', 1.94826e-06, {'tpah': [0, 5, 6]}],
			['пробковый', 1.32623e-06, {'tpah': [0, 5, 9]}]],
		['fact', 'пробки спб', '3'],
		{
			'suggestions': [
				['пробки спб онлайн', 3.088935046e-05, {'src': 'B'}],
				['пробки на дорогах спб в реальном времени', 1.843455357e-05, {'src': 'B'}],
				['пробки спб онлайн в реальном времени', 1.453568166e-05, {'src': 'B'}],
				['пробки спб онлайн в реальном времени на карте', 5.909338597e-06, {'src': 'B'}],
				['пробки в санкт-петербурге', 5.827183031e-06, {'src': 'B'}]
			]
		}],
	'time': ['время', 'время',
		[['время намаза', 2.42625e-05, {'tpah': [6, 6, 12]}],
			['время первых', 2.14571e-05, {'tpah': [6, 6, 12]}],
			['время намаза в спб', 1.20252e-05, {'tpah': [6, 6, 12]}],
			['время спб', 4.62681e-06, {'tpah': [6, 6, 9]}]],
		['fact', 'время', '16:38'],
		{
			'suggestions': [
				['время', 3.27527523e-05, {'src': 'B'}],
				['время намаза в санкт-петербурге', 8.590519428e-06, {'src': 'B'}],
				['время первых фильм 2017', 7.390975952e-06, {'src': 'B'}],
				['время и стекло', 4.563480616e-06, {'src': 'B'}],
				['время приключений', 3.844499588e-06, {'src': 'B'}]
			]
		}],
	'time_difference': ['разница во времени москва париж', 'разница во времени москва париж',
		[['разница во времени москва париж сейчас', 1.22556e-08, {'tpah': [32, 32, 38]}],
			['разница во времени москва париж зимой', 7.98333e-09, {'tpah': [32, 32, 37]}],
			['разница во времени москва париж летом', 7.51667e-09, {'tpah': [32, 32, 37]}],
			['разница во времени москва париж после 26', 5.26111e-09, {'tpah': [32, 32, 37]}]],
		['fact', 'разница во времени москва париж', '-1 час (Москва - 16:42, Париж - 15:42)'],
		{
			'suggestions': [
				['разница во времени москва париж', 1.464444477e-08, {'src': 'T'}],
				['разница во времени москва париж после 26 октября', 5.261111102e-09, {'src': 'T'}],
				['разница во времени москва париж 2016', 3.300000051e-09, {'src': 'T'}],
				['разница во времени москва париж сегодня', 3.300000051e-09, {'src': 'T'}],
				['разница во времени москва париж 14-00', 2.844444458e-09, {'src': 'T'}]
			]
		}],
	'fact': ['длина', 'длина окружности', [
		['длина окружности!!!!', 1.85167e-08, {'tpah': [6, 6, 16]}],
		['длина окружности формула', 7.76389e-09, {'tpah': [6, 6, 16]}],
		['длина экватора', 6.14444e-09, {'tpah': [6, 6, 14]}],
		['длина волны', 5.93056e-09, {'tpah': [6, 6, 11]}]],
		['fact', 'длина окружности', 'l = 2πR (или πD)'],
		{
			'suggestions': [
				['длина австралии с запада на восток', 3.539869065e-09],
				['длина великой китайской стены', 2.252777742e-09]
			]
		}
	],
	'distance': ['расстояние от мос', 'расстояние от москвы до питера', [
		['расстояние от москвы', 1.55622e-06, {'tpah': [14, 17, 20]}],
		['расстояние от москвы до питера', 2.36916e-07, {'tpah': [14, 17, 20]}],
		['расстояние от москвы до санкт-петербурга', 1.19035e-07, {'tpah': [14, 17, 20]}],
		['расстояние от москвы до воронежа', 7.23521e-08, {'tpah': [14, 17, 20]}]],
		['fact', 'расстояние от москвы до питера', '634 км (по прямой)'],
		{
			'suggestions': [
				['расстояние от москвы до ростова на дону', 4.083267413e-08, {'src': 'B'}],
				['расстояние от москвы до твери', 3.850436769e-08, {'src': 'B'}],
				['расстояние от москвы до нижнего новгорода', 3.501190804e-08, {'src': 'B'}],
				['расстояние от москвы до владивостока', 3.384775482e-08, {'src': 'B'}],
				['расстояние от москвы до тулы', 3.26836016e-08, {'src': 'B'}]
			]
		}
	],
	'holiday': ['како', 'какой сегодня праздник', [
		['какой', 8.00695e-05, {'tpah': [0, 4, 5]}],
		['какой сегодня', 6.23997e-05, {'tpah': [0, 4, 5]}],
		['какого', 1.38002e-05, {'tpah': [0, 4, 6]}],
		['какого числа', 1.32179e-05, {'tpah': [0, 4, 6]}]],
		['fact', 'какой сегодня праздник', 'День образования Республики Адыгея, Всемирный день учителя'],
		{
			'suggestions': [
				['какой сегодня праздник', 3.758072853e-05, {'src': 'B'}],
				['какой сегодня праздник в россии', 5.673617125e-06, {'src': 'B'}],
				['какой сегодня праздник по церковному календарю 2017', 4.74601984e-06, {'src': 'B'}],
				['какой сегодня церковный праздник', 4.306435585e-06, {'src': 'B'}],
				['какого числа день учителя в 2017 году', 4.302710295e-06, {'src': 'B'}]
			]
		}
	],
	'date': ['какое ', 'какое количество теплоты выделилось при остывании воды объемом 20', [
		['какое количество', 4.74356e-06, {'tpah': [6, 6, 16]}],
		['какое количество теплоты', 4.59534e-06, {'tpah': [6, 6, 16]}],
		['какое сегодня', 1.67917e-06, {'tpah': [6, 6, 13]}],
		['какое море', 1.16127e-06, {'tpah': [6, 6, 10]}]],
		['fact', 'какое сегодня число', '5 октября 2017'],
		{
			'suggestions': [
				['какое', 2.30409205e-06, {'src': 'Art_endings'}],
				['какое количество теплоты выделилось при остывании воды объемом 20', 2.30409205e-06, {'src': 'B'}],
				['какое сегодня число', 1.679174602e-06, {'src': 'B'}],
				['какое будет лето 2017 в спб', 7.152557373e-07, {'src': 'B'}],
				['какое значение имеет имя в жизни человека', 6.33765012e-07, {'src': 'B'}]
			]
		}
	],
	'moon': ['фаза', 'фаза луны сегодня', [
		['фаза луны', 1.03921e-05, {'tpah': [5, 5, 9]}],
		['фаза луны сегодня', 7.14764e-06, {'tpah': [5, 5, 9]}],
		['фазан', 7.36254e-07, {'tpah': [0, 4, 5]}],
		['фаза ноль', 1.19049e-07, {'tpah': [5, 5, 9]}]],
		['fact', 'фаза луны сегодня', 'убывающая Луна, 17 лунный день'],
		{
			'suggestions': [
				['фаза луны сегодня сентябрь 2017', 1.274049282e-06, {'src': 'B'}],
				['фаза', 2.100132406e-07, {'src': 'B'}],
				['фаза луны на октябрь 2017', 1.972075552e-07, {'src': 'B'}],
				['фаза луны сегодня сентябрь', 1.85566023e-07, {'src': 'B'}],
				['фаза луны сегодня на июнь 2017', 1.668231562e-07, {'src': 'B'}]
			]
		}
	],
	'stock': ['ку', 'кубок конфедераций 2017', [
		['кубок', 0.00024144, {'tpah': [0, 2, 5]}],
		['кубок конфедераций', 0.000241019, {'tpah': [0, 2, 5]}],
		['курс', 0.000228734, {'tpah': [0, 2, 4]}],
		['курс доллара', 0.00010007, {'tpah': [0, 2, 4]}]],
		['fact', 'курс доллара', '57,54 рубля (курс Мосбиржи)'],
		{
			'suggestions': [
				['кубок конфедераций 2017', 0.0001838207245, {'src': 'B'}],
				['курс евро', 6.055831909e-05, {'src': 'B'}],
				['курс доллара на сегодня', 1.980364323e-05, {'src': 'B'}],
				['купить билет на самолет', 1.928742331e-05, {'src': 'B'}],
				['курс евро на сегодня', 1.879036427e-05, {'src': 'B'}]
			]
		}
	],
	'calc': ['666 плюс 666', '666 плюс 666',
		[],
		['fact', '666 плюс 666', '666 + 666 = 1332'],
		{
			'suggestions': [
				['666 плюс 666', 3.991666553e-09, {'src': 'T'}],
				['знак плюс 666', 3.886963891e-15, {'src': 'Tail_word'}]
			]
		}
	],
	'trans': ['april пер', 'april перевод', [
		['april перевод', 3.71314e-08, {'tpah': [6, 9, 13]}],
		['april перевод на русский', 9.85556e-09, {'tpah': [6, 9, 13]}],
		['april перевести', 3.675e-09, {'tpah': [6, 9, 15]}],
		['april переводчик', 3.3e-09, {'tpah': [6, 9, 16]}]],
		['fact', 'april перевод', '(с англ.) апрель'],
		{
			'suggestions': [
				['april перевод песни', 3.675000082e-09, {'src': 'T'}],
				['april перевод с английского', 3.675000082e-09, {'src': 'T'}],
				['april перевод транскрипция', 2.844444458e-09, {'src': 'T'}],
				['april перевод слова', 2.252777742e-09, {'src': 'T'}],
				['april перевод и транскрипция', 1.422222229e-09, {'src': 'T'}]
			]
		}
	],
	'planet': ['погода на сат', 'погода на сатурне', [
		['погода на сатурне', 3.61806e-08, {'tpah': [10, 13, 17]}],
		['погода на сатанів', 8.775e-09, {'tpah': [10, 13, 17]}],
		['погода на сатурне шестиугольный', 7.66667e-09, {'tpah': [10, 13, 17]}],
		['погода на сатанівці', 4.26667e-09, {'tpah': [10, 13, 19]}]],
		['fact', 'погода на сатурне', 'шестиугольный вихрь'],
		{
			'suggestions': [
				['погода на сатурне сейчас', 6.244444517e-09, {'src': 'T'}],
				['погода на сатурне шестиугольный вихрь', 6.244444517e-09, {'src': 'T'}],
				['погода на сатке', 4.266666576e-09, {'src': 'T'}],
				['погода на сатурн', 3.991666553e-09, {'src': 'T'}],
				['погода на сатурне видео', 3.991666553e-09, {'src': 'T'}]
			]
		}
	],
	'day_to': ['сколько дней до', 'сколько дней до нового года', [
		['сколько дней до нового', 6.43769e-07, {'tpah': [16, 16, 22]}],
		['сколько дней до нового года', 5.74924e-07, {'tpah': [16, 16, 22]}],
		['сколько дней до лета', 1.83236e-07, {'tpah': [16, 16, 20]}],
		['сколько дней должны', 1.30705e-07, {'tpah': [13, 15, 19]}]],
		['fact', 'сколько дней до лета', '238 дней'],
		{
			'suggestions': [
				['сколько дней до нового года 2018', 1.937150955e-07, {'src': 'B'}],
				['сколько дней до дмб', 9.452924132e-08, {'src': 'B'}],
				['сколько дней до', 4.199682735e-08, {'src': 'B'}],
				['сколько дней до 12 декабря', 4.199682735e-08, {'src': 'B'}],
				['сколько дней до зимы', 4.083267413e-08, {'src': 'B'}]
			]
		}
	]
};

module.exports.fakeResTr = fakeResTr;
module.exports.fakeResRu = fakeResRu;
