import typing as tp

from taxi.util import dates

from workforce_management.common.jobs.setup import wiki_schedule_dump_job
from workforce_management.common.utils import datetime_utils


EMPTY_SCHEDULE = {
    'WFM график': '-',
    'WFM смещение': '-',
    'Кадровый график': '-',
    'Кадровая смена': '-',
    'Часы': 'None - None',
}


def get_date_templates() -> tp.List[tp.Dict[str, tp.Any]]:
    now = dates.localize()
    months = [now, datetime_utils.next_month_start(now)]
    gen_dates = (
        lambda x: wiki_schedule_dump_job._make_shifts_columns(  # noqa pylint: disable=protected-access
            *datetime_utils.month_bounds(x),
        )
    )
    return [
        {**EMPTY_SCHEDULE, **{date: None for date in gen_dates(dttm)}}
        for dttm in months
    ]


EXPECTED_DATA_0 = [
    {
        'Abdullin Damir abd-damir': {
            'WFM график': (
                '10-00, 10-00, вых, вых (не соответствует действительности)'
            ),
            'WFM смещение': '1',
            'Кадровый график': 'blablaa',
            'Кадровая смена': 'blablabla',
            'Страна': 'vacanda',
            'Юр.лицо': 'Google',
            'Часовой пояс': 'Europe/Saratov',
            'Часы': '00:00:00 - 00:00:00',
            '01.07.2020': '10:00:00 - 22:00:00',
            '03.07.2020': '04:00:00 - 16:00:00',
            '04.07.2020': '22:00:00 - 10:00:00',
            '06.07.2020': '16:00:00 - 04:00:00',
            '08.07.2020': '10:00:00 - 22:00:00',
            '10.07.2020': '04:00:00 - 16:00:00',
            '11.07.2020': '22:00:00 - 10:00:00',
            '13.07.2020': '16:00:00 - 04:00:00',
            '15.07.2020': '10:00:00 - 22:00:00',
            '17.07.2020': '04:00:00 - 16:00:00',
            '18.07.2020': '22:00:00 - 10:00:00',
            '20.07.2020': '16:00:00 - 04:00:00',
            '22.07.2020': '10:00:00 - 22:00:00',
            '24.07.2020': '04:00:00 - 16:00:00',
            '25.07.2020': '22:00:00 - 10:00:00',
            '27.07.2020': '16:00:00 - 04:00:00',
            '29.07.2020': '10:00:00 - 22:00:00',
            '31.07.2020': '04:00:00 - 16:00:00',
        },
        'Anonymous Anonymous unknown': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
        'Gilgenberg Valeria chakchak': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
        'Kazimir Malevich kazimir_black_square': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
        'Minihanov Minihanov tatarstan': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
    },
    {
        'Abdullin Damir abd-damir': {
            'Страна': 'vacanda',
            'Юр.лицо': 'Google',
            'Часовой пояс': 'Europe/Saratov',
        },
        'Anonymous Anonymous unknown': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
        'Gilgenberg Valeria chakchak': {
            'WFM график': (
                '10-00, 10-00, вых, вых (не соответствует действительности)'
            ),
            'WFM смещение': '1',
            'Кадровый график': 'blablaa',
            'Кадровая смена': 'blablabla',
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
            'Часы': '00:00:00 - 00:00:00',
            '02.08.2020': '03:00:00 - 15:00:00',
            '03.08.2020': '21:00:00 - 09:00:00',
            '05.08.2020': '15:00:00 - 03:00:00',
            '07.08.2020': '09:00:00 - 21:00:00',
            '09.08.2020': '03:00:00 - 15:00:00',
            '10.08.2020': '21:00:00 - 09:00:00',
            '12.08.2020': '15:00:00 - 03:00:00',
            '14.08.2020': '09:00:00 - 21:00:00',
            '16.08.2020': '03:00:00 - 15:00:00',
            '17.08.2020': '21:00:00 - 09:00:00',
            '19.08.2020': '15:00:00 - 03:00:00',
            '21.08.2020': '09:00:00 - 21:00:00',
            '23.08.2020': '03:00:00 - 15:00:00',
            '24.08.2020': '21:00:00 - 09:00:00',
            '26.08.2020': '15:00:00 - 03:00:00',
            '28.08.2020': '09:00:00 - 21:00:00',
            '30.08.2020': '03:00:00 - 15:00:00',
            '31.08.2020': '21:00:00 - 09:00:00',
        },
        'Kazimir Malevich kazimir_black_square': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
        'Minihanov Minihanov tatarstan': {
            'Страна': 'ru',
            'Юр.лицо': 'Яндекс.Такси',
            'Часовой пояс': 'Europe/Moscow',
        },
    },
]

EXPECTED_DATA_1 = [
    {
        **EXPECTED_DATA_0[0],
        'Abdullin Damir abd-damir': {
            **EMPTY_SCHEDULE,
            'Страна': 'vacanda',
            'Юр.лицо': 'Google',
            'Часовой пояс': 'Europe/Saratov',
        },
    },
    {
        **EXPECTED_DATA_0[1],
        'Abdullin Damir abd-damir': {
            'WFM график': '5/2 (вых. сб, вс) ',
            'WFM смещение': '1',
            'Кадровая смена': 'blablabla',
            'Кадровый график': 'blablaa',
            'Часы': '14:00:00 - 04:00:00',
            'Страна': 'vacanda',
            'Часовой пояс': 'Europe/Saratov',
            'Юр.лицо': 'Google',
            '01.08.2020': '14:00:00 - 04:00:00',
            '02.08.2020': '14:00:00 - 04:00:00',
            '03.08.2020': '14:00:00 - 04:00:00',
            '04.08.2020': '14:00:00 - 04:00:00',
            '07.08.2020': '14:00:00 - 04:00:00',
            '08.08.2020': '14:00:00 - 04:00:00',
            '09.08.2020': '14:00:00 - 04:00:00',
            '10.08.2020': '14:00:00 - 04:00:00',
            '11.08.2020': '14:00:00 - 04:00:00',
            '14.08.2020': '14:00:00 - 04:00:00',
            '15.08.2020': '14:00:00 - 04:00:00',
            '16.08.2020': '14:00:00 - 04:00:00',
            '17.08.2020': '14:00:00 - 04:00:00',
            '18.08.2020': '14:00:00 - 04:00:00',
            '21.08.2020': '14:00:00 - 04:00:00',
            '22.08.2020': '14:00:00 - 04:00:00',
            '23.08.2020': '14:00:00 - 04:00:00',
            '24.08.2020': '14:00:00 - 04:00:00',
            '25.08.2020': '14:00:00 - 04:00:00',
            '28.08.2020': '14:00:00 - 04:00:00',
            '29.08.2020': '14:00:00 - 04:00:00',
            '30.08.2020': '14:00:00 - 04:00:00',
        },
        'Gilgenberg Valeria chakchak': {
            'WFM график': '5/2 (вых. сб, вс) ',
            'WFM смещение': '1',
            'Кадровая смена': 'blablabla',
            'Кадровый график': 'blablaa',
            'Страна': 'ru',
            'Часовой пояс': 'Europe/Moscow',
            'Часы': '13:00:00 - 03:00:00',
            'Юр.лицо': 'Яндекс.Такси',
            '01.08.2020': '13:00:00 - 03:00:00',
            '02.08.2020': '13:00:00 - 03:00:00',
            '03.08.2020': '13:00:00 - 03:00:00',
            '04.08.2020': '13:00:00 - 03:00:00',
            '07.08.2020': '13:00:00 - 03:00:00',
            '08.08.2020': '13:00:00 - 03:00:00',
            '09.08.2020': '13:00:00 - 03:00:00',
            '10.08.2020': '13:00:00 - 03:00:00',
            '11.08.2020': '13:00:00 - 03:00:00',
            '14.08.2020': '13:00:00 - 03:00:00',
            '15.08.2020': '13:00:00 - 03:00:00',
            '16.08.2020': '13:00:00 - 03:00:00',
            '17.08.2020': '13:00:00 - 03:00:00',
            '18.08.2020': '13:00:00 - 03:00:00',
            '21.08.2020': '13:00:00 - 03:00:00',
            '22.08.2020': '13:00:00 - 03:00:00',
            '23.08.2020': '13:00:00 - 03:00:00',
            '24.08.2020': '13:00:00 - 03:00:00',
            '25.08.2020': '13:00:00 - 03:00:00',
            '28.08.2020': '13:00:00 - 03:00:00',
            '29.08.2020': '13:00:00 - 03:00:00',
            '30.08.2020': '13:00:00 - 03:00:00',
            '31.08.2020': '13:00:00 - 03:00:00',
        },
    },
]
